const blacklistData = [
    { 
        qq: ['2175709646', '276423602'],  // 多个 QQ
        qqNickname: ['夜白/世俗', '龙儿'],  // 多个 QQ 昵称
        name: [''],  // 姓名也支持多个
        phone: [''],  // 多个手机号
        alipay: [''],  // 支付宝账号
        wechat: [''],  // 多个微信账号
        bankCard: [''],  // 多个银行卡
        idCard: ['']  // 身份证也支持多个
    },
    { 
        qq: ['80037382'], 
        qqNickname: ['南天门'],
        name: [''],
        phone: [''], 
        alipay: [''], 
        wechat: [''],
        bankCard: [''], 
        idCard: [''] 
    },
    { 
        qq: ['5511984','3784621615','857350111','3177794450','1425228431','3489106577'], 
        qqNickname: ['杀神/诗诗','时间/财富','黑狼','北念','糖豆','龙泽'],
        name: ['崔艳兰'],
        phone: [''], 
        alipay: ['15852252743'], 
        wechat: [''],
        bankCard: ['6228480458217006972'], 
        idCard: [''] 
    },
    { 
        qq: ['2454928288'],  // 多个 QQ
        qqNickname: ['猩猩'],  // 多个 QQ 昵称
        name: ['王义程'],  // 姓名也支持多个
        phone: [''],  // 多个手机号
        alipay: [''],  // 支付宝账号
        wechat: [''],  // 多个微信账号
        bankCard: [''],  // 多个银行卡
        idCard: ['']  // 身份证也支持多个
    },
    { 
        qq: ['1535959373'],  // 多个 QQ
        qqNickname: ['塔寨联盟林耀东-epay.huvbz.cn'],  // 多个 QQ 昵称
        name: ['程中'],  // 姓名也支持多个
        phone: [''],  // 多个手机号
        alipay: [''],  // 支付宝账号
        wechat: [''],  // 多个微信账号
        bankCard: [''],  // 多个银行卡
        idCard: ['']  // 身份证也支持多个
    },
    { 
        qq: [''],  // 多个 QQ
        qqNickname: ['阿里聚合支付'],  // 多个 QQ 昵称
        name: ['张旭东'],  // 姓名也支持多个
        phone: [''],  // 多个手机号
        alipay: [''],  // 支付宝账号
        wechat: [''],  // 多个微信账号
        bankCard: [''],  // 多个银行卡
        idCard: ['']  // 身份证也支持多个
    },
];
